tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Kubernetes package manager
brew "helm"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Platform built on V8 to build network applications
brew "node"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# Terminal multiplexer
brew "tmux"
# JavaScript package manager
brew "yarn"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
