bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
esbenp.prettier-vscode
fabiospampinato.vscode-todo-plus
github.github-vscode-theme
golang.go
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
pkief.material-icon-theme
redhat.java
rodrigovallades.es7-react-js-snippets
vmware.vscode-spring-boot
vscjava.vscode-maven
vscodevim.vim
yzhang.markdown-all-in-one
